[
  {
    "id": 1,
    "title": "תופעות הלוואי של תרופה X",
    "category": "medicine",
    "content": "תרופה X משמשת לטיפול בדלקות כרוניות. תופעות הלוואי הנפוצות כוללות כאבי ראש, בחילות והקאות. קצת מהחולים דיווחו על רעד בידיים וירידה באפתיט. במקרים נדירים, אולי קיימות תופעות אלרגיות חמורות הדורשות עזרה רפואית מיידית. יש להימנע מהשימוש בתרופה זו במהלך ההיריון."
  },
  {
    "id": 2,
    "title": "דוקטרינה משפטית בנושא חוק הצרכן",
    "category": "law",
    "content": "חוק הצרכן בישראל מגן על הציבור מפני עסקאות בלתי הוגנות. החוק קובע אחריות למוכר במקרה של פגמים בסחורה. הצרכן רשאי לדרוש החזר כסף או החלפת המוצר תוך שלושים ימים. צרכנים זכאים גם להגנה מפני פרסום מטעה ותנאים כללים בלתי הוגנים."
  },
  {
    "id": 3,
    "title": "טכנולוגיית ענן מחשוב",
    "category": "technology",
    "content": "חוסן ועיקום טכנולוגיה ענן מובנה בתשתיות הגדולות. מרכזי נתונים מפוזרים מונעים אובדן מידע בעת שקעים. שימוש בצפנה מקצה לקצה מבטיח הגנה על הנתונים. פלטפורמות ענן מודרניות מאפשרות הרחבה אוטומטית בהתאם לביקוש."
  },
  {
    "id": 4,
    "title": "סוכרת מסוג 2 ודיאטה",
    "category": "medicine",
    "content": "סוכרת מסוג 2 קשורה לעיתים קרובות להשמנה ולאורח חיים סדנטרי. ניהול תזונה שומר על רמות סוכר בדם יציבות. מרכיבים דיאטטיים חשובים כוללים חיתוך פחמימות פשוטות וגדלת סיבים. דיכוך קל ופעילות גופנית יומית משפרים בקרה גליקמית."
  },
  {
    "id": 5,
    "title": "הסכמים בדין חוזים",
    "category": "law",
    "content": "הסכם חוקי דורש הסכמת כל הצדדים על תנאים קריטיים. הצדדים חייבים להיות בעלי כושר משפטי מלא כדי להיות מחייבים בחוזה. שינויים בהסכם דורשים הסכמה בכתב מכל הצדדים. הפרת החוזה עלולה להוביל לתביעת שיפוי נזקים או ביטול החוזה."
  },
  {
    "id": 6,
    "title": "בינה מלאכותית ולמידת מכונה",
    "category": "technology",
    "content": "למידת מכונה מאפשרת מכונות ללמוד מנתונים ולשפר ביצועים. רשתות עצביות עמוקות משמשות בהכרה בתמונות וזיהוי קול. אימון מודלים דורש כמויות גדולות של נתונים ותוכנות מיוחדות. אתיקה של בינה מלאכותית היא קריטית כדי להימנע מהטיות הישנה."
  },
  {
    "id": 7,
    "title": "יתר לחץ דם וסיבוכים",
    "category": "medicine",
    "content": "יתר לחץ דם הוא גורם סיכון חיוני למחלות לב וכלי דם. חסרי יוני נתרן בתזונה עוזרים להקטין לחץ דם. תרופות כמו ACE מעכבים וחוסמי בטא משמשות לטיפול. בדיקות קביעות של לחץ דם ודיאטה בריאה חיוניות."
  },
  {
    "id": 8,
    "title": "זכויות עובדים בישראל",
    "category": "law",
    "content": "חוק היחסים הקיבוציים קובע זכויות בסיסיות לעובדים. עובדים זכאים לשכר מינימום, חופש שנתי ותביעות בטחון סוציאלי. העסקת נשים או מיעוטים אסורה על בדלות או הפליה. שיתופי פעולה בין מעסיקים ועובדים מאפשרים קביעת תנאים טובים יותר."
  },
  {
    "id": 9,
    "title": "סייבר אבטחה וקריפטוגרפיה",
    "category": "technology",
    "content": "הגנה כנגד התקפות סייבר דורשת שימוש בצפנה חזקה. אלגוריתמים RSA ו-AES משמשים לאבטחת מידע. אימות רב-גורמי מוסיף שכבה נוספת של הגנה לחשבונות. עדכונים קבועים של תוכנה ותיקוני אבטחה הם חיוניים."
  },
  {
    "id": 10,
    "title": "סרטן והטיפול בכימותרפיה",
    "category": "medicine",
    "content": "כימותרפיה משמשת לטיפול בסרטן על ידי הרס תאים סרטניים. טיפולים יוצרים תופעות לוואי קשות כמו נשירת שיער ודלילת דם. משלב הטיפול משך למספר חודשים וקשה מנקודת ראות פיזית. תמיכה נפשית וטיפולית חיונית במהלך התהליך."
  },
  {
    "id": 11,
    "title": "זכויות יוצרים וקניין רוחני",
    "category": "law",
    "content": "זכויות יוצרים מגנות על יצירות אמנות וספרות. למחברים וםאמנים יש זכות בלעדית למכור או להפיץ את יצירתם. תקופת ההגנה נמשכת בדרך כלל שנים רבות אחרי מות היוצר. הפרות של זכויות יוצרים עלולות להוביל לקנסות כספיים וכלא."
  },
  {
    "id": 12,
    "title": "מערכות נתונים ובסיסי נתונים",
    "category": "technology",
    "content": "בסיסי נתונים יחסיים מאחסנים מידע בטבלאות המחוברות. שפות כמו SQL משמשות לחיפוש וניהול מידע. אינדקסים משפרים מהירות של שאילתות בבסיסי נתונים גדולים. גיבויים קבועים מובטחים בטיחות הנתונים."
  },
  {
    "id": 13,
    "title": "מחלות זיהומיות וחסינות",
    "category": "medicine",
    "content": "מחלות זיהומיות גורמות לנזק דרך חיידקים או וירוסים. מערכת החסינות של הגוף נלחמת בזיהומים בתגובות דלקות. חיסונים מונעים מחלות ספציפיות על ידי הכנת מערכת החסינות. אנטיביוטיקה יעילה רק נגד חיידקים, לא נגד וירוסים."
  },
  {
    "id": 14,
    "title": "משפחה וחוק גירושין",
    "category": "law",
    "content": "גירושין בישראל דורשים הכנת הסכם בחלוקת רכוש וגידול ילדים. בית דין רבני פוסק בנושאי משפחה לישראלים יהודים. זכויות שמירה על ילדים מתבססות על טוב הילדים. תשלום דמי תחזוקה נדרש לתמיכה בילדים מטעם ההורה הלא מגודל."
  },
  {
    "id": 15,
    "title": "פיתוח תוכנה באמצעות Agile",
    "category": "technology",
    "content": "שיטת Agile מאפשרת לצוותים להתאים מהר לדרישות משתנות. ספרינטים קצרים מאפשרים משוב וטיוב המוצר. ישיבות יומיות מודעות את הצוות בהתקדמות. טכניקות כמו pair programming משפרות איכות הקוד."
  },
  {
    "id": 16,
    "title": "אלרגיות וטיפול בכנטון",
    "category": "medicine",
    "content": "אלרגיות נוצרות כאשר מערכת חסינות מגיבה בעלייה לחומר חסר ממשות. סימפטומים כוללים גרד, זיעה וקשיי נשימה. תרופות אנטיהיסטמינים מקלות על התסמינים. חשיפה להדרגה לאלרגן יכולה להפחית רגישות בהדרגה."
  },
  {
    "id": 17,
    "title": "מע'מ וחדשנות במיסוי",
    "category": "law",
    "content": "מע'מ הוא מס על ערך מוסף של מוצר או שירות. שיעור המס משתנה בהתאם לסוג הטובין והשירותים. עסקים זקוקים לתיעוד מדוקדק של כל העסקאות. החזרי מע'מ מבוצעים לפי תקופות דיווח קבועות."
  },
  {
    "id": 18,
    "title": "אינטרנט של דברים וחיישנים",
    "category": "technology",
    "content": "חיישנים חכמים יכולים לעקוב אחר טמפרטורה, לחות ותנועה. טכנולוגיית WiFi ו-Bluetooth מקדמת התקשורת בין חיישנים. בתים חכמים משתמשים ב-IoT כדי לשפר נוחות וחיסכון בחשמל. בעיות אבטחה דורשות הצפנה וניהול סיסמה חזק."
  },
  {
    "id": 19,
    "title": "טיפול פסיכולוגי דיכאון",
    "category": "medicine",
    "content": "דיכאון גורם לעצב עמוק ואובדן עניין בפעילויות. טיפולים כוללים תרופות נוגדות דיכאון וקוגניטיביים בהוראה. קבוצות תמיכה מסייעות לחולים להתמודד עם הטרורים הנפשיים. תרגול קביל ותקשורת חברתית חיוניים לשיקום."
  },
  {
    "id": 20,
    "title": "קניין תעשייתי וברור פטנטים",
    "category": "law",
    "content": "פטנטים מגנות על המצאות חדשות ממקצועות שונים. בקשה לפטנט דורשת הוכחה של חידוש וחידוש תאוריטי. פטנטים נמשכים בדרך כלל עשרים שנה מתאריך הגשת הבקשה. חברות ממחמירות על שימוש לא מורשה של פטנטים שלהם."
  }
]
